 let question1 = prompt("Перше питання: як звали першого президента України? 1 - Володимир Зеленський, 2 - Віктор Януковіч, 3 - Леонід Кравчук, 4 - Леонід Кучма","");

if(question1 === "Леонід Кравчук"){
alert("Правильна відповідь! Ви виграли 500 грн")

let question2 = prompt("Що є одним із символів України? 1 - Калина, 2 - Вино, 3 - Піца, 4 - Круасан");

if(question2 === "Калина"){
alert("Правильна відповідь! Ви виграли 1000 грн")
let question3 = prompt("Яке місто в Україні було другою столицею? 1 - Львів, 2 - Харків, 3 - Одеса, 4 - Миколаїв");

if(question3 === "Харків"){
alert("Правильна відповідь! Ви виграли 1500 грн")
;}
else{
alert("Нажаль ви програли");
}
;}
else{
alert("Нажаль ви програли");
}
;}
else{
alert("Нажаль ви програли");
}
