//Префіксний варіант ++i: 
let i = 0; 
while (++i < 5) 
alert(i);
//Перше значення - i = 1, тому що операція ++i спочатку збільшує i, а потім попередження порівнюється і виконується.

//Потім 2, 3, 4... Значення буде показано один за одним. Для кожного значення є збільшення, а потім порівняння, оскільки ++ знаходиться перед змінною.

//Якщо i = 4, то це збільшить i до 5 і тоді порівняйте while (5 < 5) - це не так. Тому цикл зупиниться там і значення 5 не буде показано.

//Постфіксний варіант i++
let i = 0; 
while (i++ < 5) 
alert(i); 

//Перше значення: i = 1. Давайте зупинимося на цьому. Оператор i++ збільшує i, повертаючи старе значення, так що порівняння i++ < 5 буде включати старе i = 0.

//Але наступний виклик тривоги більше не відповідає цьому виразу, тому він отримує новий i = 1.

//Потім 2, 3, 4... Для кожного значення існує порівняння, а потім збільшення, а потім і попередження.

//Кінець циклу: Якщо i = 4, буде порівняння while (4 < 5) - істина, тоді i++ буде працювати, збільшивши i до 5, так що 5 буде виведено. Це буде останнє.

//Значення i = 5 є останнім, оскільки наступний крок while (5 < 5) є хибним.
